In [1]:
import pandas as pd
import dpyp as dp
import numpy as np


df = pd.DataFrame(
    {
        'Programme School': [
            'school_of_biological_sciences',
            'school_of_natural_science',
            'school_of_engineering',
            'school_of_biological_sciences',
            'school_of_music',
            'school_of_medicine',
            'school_of_art'
        ],
        'Population_1': [
            13,
            40,
            23,
            19,
            5,
            10,
            np.nan
        ],
        'Population_2': [
            12,
            50,
            33,
            20,
            4,
            11,
            1
        ],
    }
)

dp.col_percentage(df, 'Product', 'Population_1', 'Population_2')

                Programme School  Population_1  Population_2  Product
0  school_of_biological_sciences          13.0            12    108.0
1      school_of_natural_science          40.0            50     80.0
2          school_of_engineering          23.0            33     70.0
3  school_of_biological_sciences          19.0            20     95.0
4                school_of_music           5.0             4    125.0
5             school_of_medicine          10.0            11     91.0
6                  school_of_art           NaN             1      NaN